In [1]:
### Crear Dataframes utilizados Listas 
### EJEMPLO 1

import pandas as pd

columns = ["marca", "precio", "disponibilidad"]

cocheA = ["Mercedes", 10000, True]
cocheB = ["BMW", 20000, False]

df = pd.DataFrame([cocheA, cocheB], columns=columns)
df

      marca  precio  disponibilidad
0  Mercedes   10000            True
1       BMW   20000           False

In [2]:
### Crear Dataframes utilizados Listas 
### EJEMPLO 2

import pandas as pd

columns = ["marca", "precio", "disponibilidad"]

marcas = [
    'Audi',
    'Ferrari',
    'Toyota',
    'BMW'
]

precio = [
    100000,
    200000,
    300000,
    400000
]

disponibilidad = [
    True,
    False,
    True,
    True
]

df = pd.DataFrame(
    list(zip(marcas, precio, disponibilidad)),
    columns=columns
)

df

     marca  precio  disponibilidad
0     Audi  100000            True
1  Ferrari  200000           False
2   Toyota  300000            True
3      BMW  400000            True

In [4]:
### Crear Dataframes utilizados Diccionarios 

import pandas as pd

columns = ["marca", "precio", "disponibilidad"]

marcas = [
    'Audi',
    'Ferrari',
    'Toyota',
    'BMW'
]

precio = [
    100000,
    200000,
    300000,
    400000
]

disponibilidad = [
    True,
    False,
    True,
    True
]


diccionario = {
    "marca": marcas,
    "precio": precio,
    "disponibilidad": disponibilidad
}

df = pd.DataFrame(diccionario)
df

     marca  precio  disponibilidad
0     Audi  100000            True
1  Ferrari  200000           False
2   Toyota  300000            True
3      BMW  400000            True

In [4]:
### Crear Dataframes utilizados Archivos
### EJEMPLO 1 Excel

import pandas as pd
 
df = pd.read_excel("datos.xlsx", header=None)
 
print(df)

          0       1               2
0     marca  precio  disponibilidad
1       BMW   10000            True
2  Ferrrari   20000           False
3      Audi   30000            True

In [2]:
### Crear Dataframes utilizados Archivos
### EJEMPLO 2 CSV

import pandas as pd

df = pd.read_csv('datos.csv', delimiter=',') 

df

     marca   precio  disponibilidad
0     Audi   100000            True
1  Ferrari    20000           False
2   Toyota    20000            True

In [5]:
### Crear Dataframes utilizados Archivos
### EJEMPLO 3 Archivos

import pandas as pd

tables = pd.read_html('https://en.wikipedia.org/wiki/Python_(programming_language)')

print('Tablas encontradas:', len(tables))
df1 = tables[0]  

print('Primer tabla')
print(df1.head())

Tablas encontradas: 13
Primer tabla
                0                                                  1
0             NaN                                                NaN
1        Paradigm  Multi-paradigm: object-oriented,[1] procedural...
2     Designed by                                   Guido van Rossum
3       Developer                         Python Software Foundation
4  First appeared                  20 February 1991; 31 years ago[2]

In [7]:
### Crear Dataframes utilizados Archivos
### EJEMPLO 4 JSON

import pandas as pd

ruta_archivo_json = 'datos.json'
datos = pd.read_json(ruta_archivo_json, orient='records')

df = pd.DataFrame(datos)
df

      nombre  altura  peso
0       Juan    1.76    65
1       Lina    1.65    68
2  Katherine    1.68    67

In [9]:
### Crear Dataframes utilizados Archivos
### EJEMPLO 5 JSON

import json
import pandas as pd

ruta_archivo_json = 'datos2.json'

with open(ruta_archivo_json) as archivo_json:
    datos_json = json.load(archivo_json)

lista_de_diccionarios = datos_json['datos']
datos = pd.DataFrame(lista_de_diccionarios)
datos

      nombre  altura  peso
0       Juan    1.76    65
1       Lina    1.65    68
2  Katherine    1.68    67

In [2]:
### Leer excel sin cabecera 

import pandas as pd
 
df = pd.read_excel("datos.xlsx", header=None)

df

          0       1               2
0     marca  precio  disponibilidad
1       BMW   10000            True
2  Ferrrari   20000           False
3      Audi   30000            True

In [3]:
### Leer multiples hojas de excel 

import pandas as pd
 
df = pd.read_excel("datos.xlsx", sheet_name=["Hoja1","Hoja2"])
 
print(df["Hoja1"])

      marca  precio  disponibilidad
0       BMW   10000            True
1  Ferrrari   20000           False
2      Audi   30000            True

In [4]:
### Seleccionar columnas 

import pandas as pd
 
df = pd.read_excel("datos.xlsx", sheet_name=["Hoja2"], usecols=["nombre","edad"])
 
df

{'Hoja2':       nombre  edad
 0      Diego    19
 1     Brayan    21
 2  Francisco    21}

In [7]:
### Seleccionar filas
### Mostrar solo algunas filas

import pandas as pd
 
df = pd.read_excel("datos.xlsx")
 
df.head(2)

      marca  precio  disponibilidad
0       BMW   10000            True
1  Ferrrari   20000           False

In [8]:
### Seleccionar filas 
### Fila especifica

import pandas as pd
 
df = pd.read_excel("datos.xlsx")
 
df.iloc[0]

marca               BMW
precio            10000
disponibilidad     True
Name: 0, dtype: object

In [6]:
### Seleccionar filas 
### Rango de filas

import pandas as pd
 
df = pd.read_excel("datos.xlsx")
 
df.iloc[1:3]

      marca  precio  disponibilidad
1  Ferrrari   20000           False
2      Audi   30000            True

In [9]:
### Trabajar con datos faltantes 
### isnull()

import pandas as pd 
  
import numpy as np 
  
dict = {
    'Primer puntaje':[100, 90, np.nan, 95], 
    'Segundo puntaje': [30, 45, 56, np.nan], 
    'Tercer puntaja':[np.nan, 40, 80, 98]
} 
  
df = pd.DataFrame(dict) 
  
df.isnull()

   Primer puntaje  Segundo puntaje  Tercer puntaja
0           False            False            True
1           False            False           False
2            True            False           False
3           False             True           False

In [ ]:
### Trabajar con datos faltantes 
### notnull()

import pandas as pd 
  
import numpy as np 
  
dict = {
    'Primer puntaje':[100, 90, np.nan, 95], 
    'Segundo puntaje': [30, 45, 56, np.nan], 
    'Tercer puntaja':[np.nan, 40, 80, 98]
} 
  
df = pd.DataFrame(dict) 
  
df.notnull()

In [11]:
### Trabajar con datos faltantes 
### dropna()

import pandas as pd 
  
import numpy as np 
  
dict = {
    'Primer puntaje':[100, 90, np.nan, np.nan], 
    'Segundo puntaje': [30, 45, 56, np.nan], 
    'Tercer puntaja':[np.nan, 40, 80, np.nan],
    'Cuarto porcentaje':[100, 40, 80, 20]

} 
  
df = pd.DataFrame(dict) 

### ELIMINA LAS FILAS QUE CONTENGAN NULOS
df.dropna()
### ELIMINA LAS FILAS QUE TENGAN TODOS SUS VALORES EN NULO
#df.dropna(how='all')
### ELIMINA LAS COLUMNAS QUE CONTENGAN POR LO MENOS n CANTIDAD DE VALORES NULOS
#df.dropna(axis=1)

   Primer puntaje  Segundo puntaje  Tercer puntaja  Cuarto porcentaje
1            90.0             45.0            40.0                 40
2             1.0             56.0            80.0                 80

In [14]:
### Trabajar con datos faltantes 
### fillna()

import pandas as pd 
  
import numpy as np 
  
dict = {
    'Primer puntaje':[100, 90, np.nan, np.nan], 
    'Segundo puntaje': [30, 45, 56, np.nan], 
    'Tercer puntaja':[np.nan, 40, 80, np.nan],
    'Cuarto porcentaje':[100, 40, 80, 20]

} 
  
df = pd.DataFrame(dict) 

### NOS PERMITE REMPLAZAR LOS VALORES EN NULO
df.fillna(0)
### RELLENA LOS VALORES EN NULO CON EL VALOR ANTERIOR A ESTE
#df.fillna(method='pad')
### RELLENA LOS VALORES EN NULO CON EL VALOR SIGUIENTE A ESTE
#df.fillna(method='bfill')

   Primer puntaje  Segundo puntaje  Tercer puntaja  Cuarto porcentaje
0           100.0             30.0            40.0                100
1            90.0             45.0            40.0                 40
2             NaN             56.0            80.0                 80
3             NaN              NaN             NaN                 20

In [15]:
### Trabajar con datos faltantes 
### replace()

import pandas as pd 
  
import numpy as np 
  
dict = {
    'Primer puntaje':[100, 90, np.nan, np.nan], 
    'Segundo puntaje': [30, 45, 56, np.nan], 
    'Tercer puntaja':[np.nan, 40, 80, np.nan],
    'Cuarto porcentaje':[100, 40, 80, 20]

} 
  
df = pd.DataFrame(dict) 

df.replace(to_replace= np.na, value=0)

   Primer puntaje  Segundo puntaje  Tercer puntaja  Cuarto porcentaje
0             0.0             30.0             NaN                  0
1            90.0             45.0            40.0                 40
2             NaN             56.0            80.0                 80
3             NaN              NaN             NaN                 20